# гюцпсфюел оюйерш йнрнпше онпреасчряъ б опнжеяяе бшонкмемхъ йспянбни
library(pwr)
library(effsize)
library(BSDA)
library(asbio)
library(rio)
library(dplyr)
library(rafalib)
dat <- import("cardio_train.csv") # гюцпсфюел дюрю яер
head(dat, 10)
dim(dat)                          # оПНЯРН ГМЮЙНЛХЛЯЪ Я ДЮРЮ ЯЕРНЛ
str(dat)                          # оПНЯРН ГМЮЙНЛХЛЯЪ Я ДЮРЮ ЯЕРНЛ
dat_1 <- dat[,c("gender", "weight")] # бшахпюел мсфмше ярнкажш, врнаш опнбепхрэ днярнбепмнярэ дюммшу
# опх менаундхлнярх мсфмн асдер вхярхрэ
head(dat_1,10)
summary(dat_1$weight) # бшбндхр нямнбмше ярюрхярхйх -> бхдхл, врн еярэ бея 10 йц Х 200 йц
# онялнрпхл йюйхе "йпхбше" дюммше еярэ он йюфднлс хг онкнб. 
woman <- dplyr::filter(dat_1, gender == 1) # фемыхмш
head(woman)
summary(woman) # бхдхл, врн еярэ фемыхмш я беянл 21 йц Х 200 йц
men <- dplyr::filter(dat_1, gender == 2) # Mлсфвхмш
head(men)
summary(men)   # бхдхл, врн еярэ лсфвхмш я беянл 10 йц Х 200 йц
# онялнрпхл box plot ОН ЙЮФДНЛС ОНКС. опнярн унвс онялнрперэ, дн х оняке
mypar(1,2)
boxplot(woman$weight)
boxplot(men$weight)
# Box plot - РШ ЯЛНРПЪРЭЯЪ, НВЕМЭ ОПХКХВМН, Б РНЛ ЯЛШЯКЕ, ВРН ЩРН НВЕМЭ ОНУНФЕ МЮ МНПЛЮКЭМНЕ ПЮЯОПЕДЕКЕМХЕ
# нДМЮЙН, ОНВХЯРХРЭ ДЮММШЕ МСФМН, Ю ГЮРЕЛ Ъ ЯМНБЮ ОНЯЛНРПЧ Box plot - РШ
# яМЮВЮКЮ ОНЯЛНРПХЛ, ЯЙНКЭЙН ЯРПНЙ Б ЙЮФДНЛ ЯЕРЕ АШКН, ВРНАШ ГЮРЕЛ НЖЕМХРЭ МЮЯЙНКЭЙН ЛМНЦН ДЮММШУ СЬКН
# мЮЯЙНКЭЙН ЩРН ЛНФЕР АШРЭ ЙПХРХВМН ДКЪ ОНЯКЕДСЧЫЕИ ПЮАНРШ
dim(woman)
dim(men)
# яВХРЮЧ, ВРН С ФЕМЫХМ ЯКЕДСЕР НЯРЮБХРЭ БЕЯ НР 35 йц ДН 140
# яВХРЮ, ВРН С ЭСФВХМ ЯКЕДСЕР НЯРЮБХРЭ БЕЯ НР 45 йц ДН 160
woman_1 <- subset(woman, woman$weight<=140&woman$weight>=35)
summary(woman_1)    # нркхвмн НЯРЮКХЯЭ НР 35 ДН 140
dim(woman)
dim(woman_1)        # бхдмн, врн мюанп дюммшу оврх ме онярпюдюк
dim(woman)-dim(woman_1)  # пЮГМХЖЮ БЯЕЦН Б 71 ЯРПНЙС
men_1 <- subset(men, men$weight<=160&men$weight>=45)
summary(men_1)     # нркхвмн нярюкхяэ НР 45 ДН 160
dim(men)-dim(men_1)  # пЮГМХЖЮ БЯЕЦН 38 ГМЮВЕМХИ
boxplot(woman_1$weight)
boxplot(men_1$weight)
mypar(1,1)
boxplot(woman_1$weight,men_1$weight) # опедбюпхрекэмн бгцкъмск б ндмнл тпнеиле. 
# бшбндш, дюфе опедбюпхрекэмше ядекюрэ ме онксвхрэяъ.
# оепед рел йюй ялнрперэ (опедбюпхрекэмн опнбепърэ мю мнплюкэмнярэ) онялнрпхл цхярнцпюлш
mypar(1,2)
hist(woman_1$weight, main = 'фемыхмш')
hist(men_1$weight, main = 'лсфвхмш')
# тнплю цхярнцпюл намюдефхбюер (дкъ лемъ бюфмее, пюгслееряъ, Box plot - Ш)
# хяонэгсел хмярпслемр онмюдефмее qq - цпютхйх
mypar(1,1)
qqnorm(woman_1$weight, main = 'фемыхмш')
qqline(woman_1$weight, col = 'red', lwd = 2) # мю лни бгцкъд бхгсюкэмн лнфмн нжемхрэ йюй мнплюкэмне пюяопедекемхе
qqnorm(men_1$weight, main = 'лсфвхмш')
qqline(men_1$weight, col = 'red', lwd = 2) # мю лни бгцкъд бхгсюкэмн лнфмн нжемхрэ йюй мнплюкэмне пюяопедекемхе
mypar(2,1)
qqnorm(woman_1$weight, main = 'фемыхмш')
qqline(woman_1$weight, col = 'red', lwd = 2) 
qqnorm(men_1$weight, main = 'лсфвхмш')
qqline(men_1$weight, col = 'red', lwd = 2)
# дкъ лемъ хмнцдю бюфмн онялнрперэ янблеярмн цпютхйх. онялнрпек дкъ наыеи бхгсюкэмни нжемйх
# бнглнфмн, ъ яеивюя ядекюч осярсч пюанрс, мн дкъ лемъ щрн бюфмн, ярнвйх гпемхъ нжемйх
# бнглнфмни ябъгх лефдс беянл фемыхм х лсфвхм
mu_w <- mean(woman_1$weight)
mu_m <- mean(men_1$weight)
mu_w
mu_m
mypar(1,2)
plot(density(woman_1$weight), col = 2, lwd = 3, main = 'фемыхмш')
abline(v=mu_w, col = 'red', lwd = 1)
plot(density(men_1$weight), col = 6, lwd = 2, main = 'лсфвхмш')
abline(v=mu_m, col = 'red', lwd = 1)
# ярпюммн, врн наю цпютхйю хлечр кебне ялеыемхе нрмняхрекэмн япедмецн
# я дпсцни ярнпнмш, пюдсер, усдшу анкэье
mypar(1,1)
plot(density(woman_1$weight, adjust = 3), col = 2, lwd = 3, main = 'фемыхмш х лсфвхмш')
abline(v=mu_w, col = 2, lwd = 1, lty = 1)
lines(density(men_1$weight, adjust = 3), col = 1, lwd = 2, lty =1)
abline(v=mu_m, col = 1, lwd = 1)
# днаюбхл кецемдс
legend("topright", c("лСФВХМШ", "фЕМЫХМШ"), col = c(2,1),lty =c(1,1))
# цкъдъ мю щрнр цпютхй с лемъ бнгмхйючр янлмемхъ, врн еярэ пюгкхвхе беяю
# рн еярэ, врн лш сбхдхл ярюрхярхвеяйсч пюгмхжс
#
# щрн бяе опедбюпхрекэмн. реоепэ опхярсохл й гюдюмхч йспянбни
# 1) я ОНЛНЫЭЧ ХГСВЕММШУ ТСМЙЖХИ МЮ 5 БЕАХМЮПЕ ПЮЯЯВХРЮРЭ МСФМШИ НАЗЕЛ БШАНПЙХ ДКЪ ЛНЫМНЯРХ РЕЯРЮ 90%. 
# онявхрюел ярюрхярхйс Cohen's d
d <- cohen.d(d=men_1$weight,woman_1$weight)$estimate
d
# гмювемхе 0,341 МЮУНДХРЭЯЪ ЛЕФДС ЯКЮАШЛ Х СЛЕПЕММШЛ ES
# еякх, ъ опюбхкэмн онмък яндепфюмхе кейжхх, рн лш лнфел оношрюрэяъ пюявхрюрэ менаундхлши 
# назел бшанпйх гюъбхб янаярбеммши спнбемэ Cohen's d, МЮОППХЛЕП 0,8
# рюй х онярсохл, ндмнбпелеммн гюъбхб лнымнярэ реярю 90%
pwr.t2n.test(n1=20,power = 0.9,d=0.8, sig.level = 0.05, alternative = 'two.sided')
# опх n1=20 ОПЕДКЮЦЮЕР БРНПСЧ БШАНПЙС БГЪРЭ 101 ХЯОШРЮМХЕ
# онопнасч онявхрюрэ дкъ n1=30
pwr.t2n.test(n1=30,power = 0.9,d=0.8, sig.level = 0.05, alternative = 'two.sided')
# реоепэ , ОПХ n1=30, ОПЕДКЮЦЕР 39 ХЯОШРЮМХИ. мЮБЕПМНЕ, РЮЙ АСДЕР МЕОКНУН. 
# меокнун б рнл ялшяке, врн назелш бшанпнй янонярюбхлш
pwr.t2n.test(n1=34,power = 0.9,d=0.8, sig.level = 0.05, alternative = 'two.sided')
# опх n1=34 n2=34 бнр реоепэ нркхвмн. рюй х ядекюч
# гюдюмхе ╧2
# 2) бШАПЮРЭ ЙПХРЕПХИ Х НАНЯМНБЮРЭ ЕЦН ОПХЛЕМЕМХЕ
# ямювюкю ятнплскхпсел цхонрегс
# цхонрегю H0 - ЯРЮРХЯРХВЕЯЙХ ГМЮВХЛШУ ПЮГКХВХИ мер
# юкэрепмюрхбмюъ цхонрегю H1 - ЯРЮРХЯРХВЕЯЙХ ГМЮВХЛШЕ ПЮГКХВХЪ еярэ 
# яВХРЮЧ, ВРН МСФМН ОПНБНДХРЭ t-test РЮЙ ЙЮЙ ярюмдюпрмне нрйкнмемхе цемепюкэмни янбнйсомнярх мюл мехгбеярмн
# опнбедел t-test
t.test(sample(men_1$weight,34), sample(woman_1$weight,34))
t.test(sample(men_1$weight,34), sample(woman_1$weight,34))
t.test(sample(men_1$weight,34), sample(woman_1$weight,34))
t.test(sample(men_1$weight,34), sample(woman_1$weight,34))
# яоежхюкэмн ядекюк меяйнкэйн реярнб ондпъд, врнаш онялнрперэ пюгмхжс p-value
# нр рерярю й реярс гмювемхе хглемъеряъ х щрн назъямхлн. йюфдши пюг аеперяъ
# 34 ЯКСВЮИМШУ ГМЮВЕМХЪ. 
# ъ МЕ ОНКЕМХКЯЪ Х Б НРДЕКЭМНЛ ТЮИРЕ опонбек 200 реярнб
# опхлепмн б рпеу яксвюъу МЮ 200 p-value аШКН МХФЕ 0,05
# нвемэ аш унрек щрн я бюлх наясдхрэ, мн ноюяючяэ, врн бпелемх с бюя мю рюйху йюй ъ, нянан мер 
# б ондюбкъчыел йнкхвеярбе реярнб  p-value ГМЮВХРЕКЭМН (0,15 - 0,65) АНКЭЬЕ 0,05
# явхрюч, врн бепмю мскебюъ цхонрегю - ярюрхярхвеяйх гмювхлшу пюгкхвхи мер
# гюдюмхе ╧3
# 3) бШБНД ОПЕДЯРЮБХРЭ Б БХДЕ ДНБЕПХРЕКЭМНЦН ХМРЕПБЮКЮ Б ОПНЖЕМРЮУ ДКЪ ПЮГЛЕПЮ ЩТТЕЙРЮ
# онявхрюел пюгмхжс лефдс япедмхлх гмювемхълх б %-У
((mean(men_1$weight)-mean(woman_1$weight))/mean(woman_1$weight))*100
# пюгмхжю япедмху онксвхкюяэ 6,55%
# мюбепмне щрн мю опедеке, врнаш србепфдюрэ, врн ярюрхярхвеяйни пюгмхжш мер
# онксвхл днбепхрекэмши хмрепбюк дкъ ES
ci <- t.test(men_1$weight,woman_1$weight,alternative = 'two.sided')$conf.int
result <- (ci/mean(woman_1$weight))*100
result
# C бепнърмнярэч 95% пюгмхжю лефдс япедмхл беянл фемыхх х лсфвхм
# асдер мюундхрэяъ б дхюоюгнме 
# нр 6,25% дн 6,85%
# йспянбни опнейр гюбепьем






















